using System;

// Пример консольного ввода
/*class InputConsoleDemo
{
    static void Main()
    {
// Текстовая переменная: 
        string name;
// Заголовок консольного окна: 
        Console.Title = "Давайте познакомимся ... ";
// Сообщение в консоли: 
        Console.Write("Kaк Вас зовут?");
// Считывание текста: 
        name = Console.ReadLine();
// Еще одна текстовая переменная: 
        string txt = "Очень приятно, " + name + "!";
// Заголовок консольного окна: 
        Console.Title = "Знакомство состоялось";
// Сообщение в консоли: 
        Console.WriteLine(txt);
    }
}
*/
// Задачи
/*Напишите программу, в которой пользователь вводит сначала имя,
    а затем фамилию. Программа выводит сообщение с информацией
    об имени и фамилии пользователя. Предложите версию программы,
    в которой ввод и вывод текста осуществляется с помощью диалоговых
окон. Также предложите консольную версию программы. */


/*Напишите программу, в которой пользователь вводит имя и возраст.
    Программа отображает сообщение об имени и возрасте пользователя.
    Предложите консольную версию программы и версию, в которой данные вводятся и выводятся с помощью диалоговых окон.
    */



/*Напишите программу, в которой пользователь последовательно вводит название текущего дня недели, название месяца и дату (номер дня
в месяце). Программа выводит сообщение о сегодняшней дате (день
    недели, дата, месяц). Используйте консольный ввод и вывод данных.
    Предложите версию программы, в которой для ввода и вывода данных
используются диалоговые окна. */


/*Напишите программу, в которой пользователю предлагается ввести
название месяца и количество дней в этом месяце. Программа выводит
сообщение о том, что соответствующий месяц содержит указанное количество дней. Предложите версии программы для ввода/вывода данных
    через консоль и с помощью диалоговых окон. 
    */


/*
  Напишите программу, в которой по году рождения определяется возраст пользователя. Используйте консольный ввод и вывод данных.
*/


/* Напишите программу, в которой пользователь водит имя и год рождения, а программа отображает сообщение, содержащее
 имя пользователя и его возраст. Предложите консольную версию программы, а также версию программы, в которой ввод и
 вывод данных выполняется с помощью диалоговых окон.
*/



/* Напишите программу, в которой по возрасту определяется год рождения. Возраст пользователь вводит в окно с полем,
а вычисленный год рождения отображается в другом диалоговом окне. Предложите вариант программы, в которой используется
консольный ввод и вывод данных.
*/

/* Напишите программу для вычисления суммы двух чисел. Оба числа вводятся пользователем. Для вычисления суммы
 используйте оператор+. Предложите два варианта программы: программу, в которой данные вводятся и выводятся с помощью
 диалоговых окон, и программу,в которой используется консольный ввод и вывод данных.*/

/* Напишите программу, в которой пользователь вводит число, а программой отображается последовательность из трех
 чисел: число, на единицу меньшее введенного, введенное число и число, на единицу большее введенного. Предложите
 версию программы с консольным вводоми выводом данных, а также версию программы, в которой ввод и вывод
выполняется с помощью диалоговых окон.
*/

/*Напишите программу, в которой пользователь вводит два числа, а программой вычисляется и отображается сумма и
 разность этих чисел. Предложите варианты программы с использованием консольного ввода/вывода данных и ввода и
 вывода данных с помощью диалоговых окон.*/
 